RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_ckcu.c
/*********************************************************************************************************//**
 * @file    ht32f1xxxx_ckcu.c
 * @version $Rev:: 3181         $
 * @date    $Date:: 2024-10-15 #$
 * @brief   This file provides all the Clock Control Unit firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1xxxx_ckcu.h"

/** @addtogroup HT32F1xxxx_Peripheral_Driver HT32F1xxxx Peripheral Driver
  * @{
  */

/** @defgroup CKCU CKCU
  * @brief CKCU driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Define CKCU private definitions
  * @{
  */

/* GCFGR bit field definition                                                                               */
#define CKCU_POS_CKOUTSRC       0
#define CKCU_MASK_CKOUTSRC      ((u32)0x7 << CKCU_POS_CKOUTSRC)

#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_POS_USBSRC         10
#define CKCU_MASK_USBSRC        ((u32)0x1 << CKCU_POS_USBSRC)
#endif

#define CKCU_POS_CKREFPRE       11
#define CKCU_MASK_CKREFPRE      ((u32)0x1F << CKCU_POS_CKREFPRE)

#if (LIBCFG_CKCU_USART_PRESCALER)
#define CKCU_POS_URPRE          20
#define CKCU_MASK_URPRE         ((u32)0x3 << CKCU_POS_URPRE)
#endif

#if (!LIBCFG_NO_CKCU_USBPRE)
#define CKCU_POS_USBPRE         22
#define CKCU_MASK_USBPRE        ((u32)0x3 << CKCU_POS_USBPRE)
#endif

/* GCCR bit field definition                                                                                */
#define CKCU_POS_SW             0
#if (LIBCFG_CKCU_NO_HCLK_LOW_SPEED)
#define CKCU_MASK_SW            ((u32)0x3 << CKCU_POS_SW)
#else
#define CKCU_MASK_SW            ((u32)0x7 << CKCU_POS_SW)
#endif

/* PLLCFGR bit field definition                                                                             */
#define CKCU_POS_POTD           21
#define CKCU_MASK_POTD          ((u32)0x3 << CKCU_POS_POTD)

#define CKCU_POS_PFBD           23
#if (LIBCDG_CKCU_PLL_144M)
#define CKCU_MASK_PFBD          ((u32)0x3F << CKCU_POS_PFBD)
#else
#define CKCU_MASK_PFBD          ((u32)0x1F << CKCU_POS_PFBD)
#endif

/* APBCFGR bit field definition                                                                             */
#define CKCU_POS_ADCDIV         16
#define CKCU_MASK_ADCDIV        ((u32)0x7 << CKCU_POS_ADCDIV)

/* CKST bit field definition                                                                                */
#define CKCU_POS_PLLST          8
#define CKCU_MASK_PLLST         ((u32)0xF << CKCU_POS_PLLST)

#define CKCU_POS_HSEST          16
#define CKCU_MASK_HSEST         ((u32)0x3 << CKCU_POS_HSEST)

#define CKCU_POS_HSIST          24
#define CKCU_MASK_HSIST         ((u32)0x7 << CKCU_POS_HSIST)

#if (LIBCFG_CKCU_CKSWST_LEGACY)
#define CKCU_POS_CKSWST         30
#define CKCU_MASK_CKSWST        ((u32)0x3 << CKCU_POS_CKSWST)
#else
#define CKCU_POS_CKSWST         0
#define CKCU_MASK_CKSWST        ((u32)0x7 << CKCU_POS_CKSWST)
#endif

/* GCFGR Bit Band Alias                                                                                     */
#define CKCU_BB_PLLSRC          BitBand((u32)&HT_CKCU->GCFGR, 8)
#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_BB_USBPLLSRC       BitBand((u32)&HT_CKCU->GCFGR, 9)
#endif

/* GCCR Bit Band Alias                                                                                      */
#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_BB_USBPLLEN        BitBand((u32)&HT_CKCU->GCCR, 3)
#endif
#define CKCU_BB_PLLEN           BitBand((u32)&HT_CKCU->GCCR, 9)
#define CKCU_BB_HSEEN           BitBand((u32)&HT_CKCU->GCCR, 10)
#define CKCU_BB_HSIEN           BitBand((u32)&HT_CKCU->GCCR, 11)
#define CKCU_BB_CKMEN           BitBand((u32)&HT_CKCU->GCCR, 16)
#define CKCU_BB_PSRCEN          BitBand((u32)&HT_CKCU->GCCR, 17)

/* GCIR Bit Band Alias                                                                                      */
#define CKCU_BB_CKSF            BitBand((u32)&HT_CKCU->GCIR, 0)
#define CKCU_BB_CKSIE           BitBand((u32)&HT_CKCU->GCIR, 16)

/* PLLCR Bit Band Alias                                                                                     */
#define CKCU_BB_PLLBYPASS       BitBand((u32)&HT_CKCU->PLLCR, 31)

#if (!LIBCFG_NO_BACK_DOMAIN)
/* LPCR Bit Band Alias                                                                                      */
#define CKCU_BB_BKISO           BitBand((u32)&HT_CKCU->LPCR, 0)
#endif

#if (!LIBCFG_CKCU_HSI_NO_AUTOTRIM)
/* HSICR Bit Band Alias                                                                                     */
#define CKCU_BB_TRIMEN          BitBand((u32)&HT_CKCU->HSICR, 0)
#define CKCU_BB_ATCEN           BitBand((u32)&HT_CKCU->HSICR, 1)
#define CKCU_BB_REFCLKSEL0      BitBand((u32)&HT_CKCU->HSICR, 5)
#define CKCU_BB_REFCLKSEL1      BitBand((u32)&HT_CKCU->HSICR, 6)
#endif

/**
  * @}
  */

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Macro CKCU private macros
  * @{
  */
#define CKCU_BF_WRITE(Reg, Mask, Pos, WriteValue)   (Reg = ((Reg & ~((u32)Mask)) | ((u32)WriteValue << Pos)))
#define CKCU_BF_READ(Reg, Mask, Pos)                ((Reg & (u32)Mask) >> Pos)
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @addtogroup CKCU_Exported_Functions CKCU exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the CKCU registers to the reset values.
 * @retval None
 ************************************************************************************************************/
void CKCU_DeInit(void)
{
  /* Reset system clock                                                                                     */
  CKCU_HSICmd(ENABLE);
  while (CKCU_GetClockReadyStatus(CKCU_FLAG_HSIRDY) == RESET);
  CKCU_SysClockConfig(CKCU_SW_HSI);

