RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_ckcu.c
/*********************************************************************************************************//**
 * @brief Return the operating frequency of the specific APB peripheral.
 * @param Perip: specify the APB peripheral.
 *   This parameter can be:
 *     @arg CKCU_PCLK_I2C0, CKCU_PCLK_I2C1,
 *          CKCU_PCLK_SPI0, CKCU_PCLK_SPI1,
 *          CKCU_PCLK_BFTM0, CKCU_PCLK_BFTM1,
 *          CKCU_PCLK_MCTM0, CKCU_PCLK_MCTM1,
 *          CKCU_PCLK_GPTM0, CKCU_PCLK_GPTM1,
 *          CKCU_PCLK_USART0, CKCU_PCLK_USART1,
 *          CKCU_PCLK_UART0, CKCU_PCLK_UART1,
 *          CKCU_PCLK_AFIO, CKCU_PCLK_EXTI, CKCU_PCLK_ADC, CKCU_PCLK_CMP,
 *          CKCU_PCLK_WDTR, CKCU_PCLK_BKPR,
 *          CKCU_PCLK_SCI0, CKCU_PCLK_SCI1,
 *          CKCU_PCLK_I2S,
 *          CKCU_PCLK_I2S,
 *          CKCU_PCLK_SCTM0, CKCU_PCLK_SCTM1,
 *          CKCU_PCLK_PWM0
 * @retval Frequency in Hz
 ************************************************************************************************************/
u32 CKCU_GetPeripFrequency(CKCU_PeripPrescaler_TypeDef Perip)
{
  CKCU_ClocksTypeDef Clock;

  #if (LIBCFG_CKCU_NO_APB_PRESCALER)
  CKCU_GetClocksFrequency(&Clock);
  return Clock.HCLK_Freq;
  #else
  u32 *PCSR = (u32 *)(&HT_CKCU->APBPCSR0 + (Perip >> CKCU_APBPCSR_OFFSET));
  u32 PCLKPrescaler = 0;

  if (Perip == CKCU_PCLK_BKPR)
  {
    PCLKPrescaler = 2;
  }

  Perip &= 0x0000001F;
  PCLKPrescaler += CKCU_BF_READ(*PCSR, (3UL << Perip), Perip);

  CKCU_GetClocksFrequency(&Clock);
  return (Clock.HCLK_Freq >> (PCLKPrescaler));
  #endif
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the HSE Clock Monitor function.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_CKMCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BB_CKMEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the power saving wakeup RC clock.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_PSRCWKUPCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BB_PSRCEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief Select the output clock source through the CKOUT pin.
 * @param CKOUTInit: pointer to CKCU_CKOUTInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void CKCU_CKOUTConfig(CKCU_CKOUTInitTypeDef *CKOUTInit)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_CKOUTSRC, CKCU_POS_CKOUTSRC, CKOUTInit->CKOUTSRC);
}

/*********************************************************************************************************//**
 * @brief Check whether the specific CKCU interrupt has occurred or not.
 * @param CKCU_INT: specify the CKCU interrupt source.
 *   This parameter can be any combination of the following values:
 *     @arg CKCU_INT_CKS, CKCU_INT_PLLRDY, CKCU_INT_HSERDY, CKCU_INT_HSIRDY, CKCU_INT_LSERDY, CKCU_INT_LSIRDY
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus CKCU_GetIntStatus(u32 CKCU_INT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CKCU_INT_FLAG(CKCU_INT));

  if (HT_CKCU->GCIR & CKCU_INT)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear the CKCU interrupt flag.
 * @param CKCU_INT: specify the CKCU interrupt flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg CKCU_INT_CKS       : HSE clock failure interrupt flag (NMI)
 *     @arg CKCU_INT_USBPLLRDY : USB PLL ready interrupt flag
 *     @arg CKCU_INT_PLLRDY    : PLL ready interrupt flag
 *     @arg CKCU_INT_HSERDY    : HSE ready interrupt flag
 *     @arg CKCU_INT_HSIRDY    : HSI ready interrupt flag
 *     @arg CKCU_INT_LSERDY    : LSE ready interrupt flag
 *     @arg CKCU_INT_LSIRDY    : LSI ready interrupt flag
 * @retval None
 ************************************************************************************************************/
void CKCU_ClearIntFlag(u32 CKCU_INT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CKCU_INT_FLAG(CKCU_INT));

  HT_CKCU->GCIR |= CKCU_INT;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specific CKCU interrupts.
 * @param CKCU_INT: specify the CKCU interrupt source which is enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg CKCU_INT_CKSIE       : HSE clock failure interrupt (NMI)
 *     @arg CKCU_INT_USBPLLRDYIE : USB PLL ready interrupt
 *     @arg CKCU_INT_PLLRDYIE    : PLL ready interrupt
 *     @arg CKCU_INT_HSERDYIE    : HSE ready interrupt
 *     @arg CKCU_INT_HSIRDYIE    : HSI ready interrupt
 *     @arg CKCU_INT_LSERDYIE    : LSE ready interrupt
 *     @arg CKCU_INT_LSIRDYIE    : LSI ready interrupt
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_IntConfig(u32 CKCU_INT, ControlStatus Cmd)
{
  u32 tmp1 = HT_CKCU->GCIR;

