RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_ckcu.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the peripheral clock.
 * @param Clock: specify the peripheral clock enable bits.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_PeripClockConfig(CKCU_PeripClockConfig_TypeDef Clock, ControlStatus Cmd)
{
  u32 uAHBCCR;
  u32 uAPBCCR0;
  u32 uAPBCCR1;

  uAHBCCR  = HT_CKCU->AHBCCR;
  uAPBCCR0 = HT_CKCU->APBCCR0;
  uAPBCCR1 = HT_CKCU->APBCCR1;

  uAHBCCR  &= ~(Clock.Reg[0]);
  uAPBCCR0 &= ~(Clock.Reg[1]);
  uAPBCCR1 &= ~(Clock.Reg[2]);

  if (Cmd != DISABLE)
  {
    uAHBCCR  |= Clock.Reg[0];
    uAPBCCR0 |= Clock.Reg[1];
    uAPBCCR1 |= Clock.Reg[2];
  }

  HT_CKCU->AHBCCR  = uAHBCCR;
  HT_CKCU->APBCCR0 = uAPBCCR0;
  HT_CKCU->APBCCR1 = uAPBCCR1;
}

#if (!LIBCFG_CKCU_HSI_NO_AUTOTRIM)
/*********************************************************************************************************//**
 * @brief Configure the reference clock of HSI auto-trim function.
 * @param CLKSRC: specify the clock source.
 *   This parameter can be:
 *     @arg CKCU_ATC_LSE: LSE is selected as reference clock
 *     @arg CKCU_ATC_USB: USB is selected as reference clock
 *     @arg CKCU_ATC_CKIN: External pin (CKIN) is selected as reference clock
 * @retval None
 ************************************************************************************************************/
void CKCU_HSIAutoTrimClkConfig(CKCU_ATC_TypeDef CLKSRC)
{
  #if (LIBCFG_CKCU_AUTOTRIM_NOCKIN==1)
  HT_CKCU->HSICR = (HT_CKCU->HSICR & (~(0x1 << 5))) | (CLKSRC << 5);
  #else
  HT_CKCU->HSICR = (HT_CKCU->HSICR & (~(0x3 << 5))) | (CLKSRC << 5);
  #endif
}

#if (LIBCFG_CKCU_ATM_V01)
/*********************************************************************************************************//**
 * @brief Initialize the ATC according to the specified parameters in the ATC_InitStruct.
 * @param ATC_InitStruct: pointer to a CKCU_ATCInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void CKCU_ATCInit(CKCU_ATCInitTypeDef* ATC_InitStruct)
{
  HT_CKCU->HSICR &= 0xFFFFFFF3;
  HT_CKCU->HSICR |= (u32)ATC_InitStruct->SearchAlgorithm | (u32)ATC_InitStruct->FrqTolerance;
}

/*********************************************************************************************************//**
 * @brief Automatic Trimming Algorithm Mode Selection.
 * @param Algo: Search Algorithm.
 *   This parameter can be:
 *     @arg CKCU_ATC_BINARY_SEARCH: Auto Trimming Controller is used binary search to approach the target range
 *     @arg CKCU_ATC_LINEAR_SEARCH: Auto Trimming Controller is used linear search to approach the target range
 * @retval None
 ***********************************************************************************************************/
void CKCU_HSIAutoTrimAlgorithm(u32 Algo)
{
  HT_CKCU->HSICR = (HT_CKCU->HSICR & (~(0x1 << 3))) | Algo;
}

/*********************************************************************************************************//**
 * @brief Lock Target Range Selection.
 * @param Tolerance: Variation Tolerance.
 *   This parameter can be:
 *     @arg CKCU_ATC_DOUBLE_PRECISION: 0.2 % variation
 *     @arg CKCU_ATC_SINGLE_PRECISION: 0.1 % variation
 * @retval None
 ***********************************************************************************************************/
void CKCU_HSIAutoTrimFreqTolerance(u32 Tolerance)
{
  HT_CKCU->HSICR = (HT_CKCU->HSICR & (~(0x1 << 2))) | Tolerance;
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable the HSI auto-trim function.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_HSIAutoTrimCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BB_TRIMEN = Cmd;
  CKCU_BB_ATCEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief Check Auto Trim is ready or not.
 * @retval TRUE or FALSE
 ************************************************************************************************************/
bool CKCU_HSIAutoTrimIsReady(void)
{
#if (LIBCFG_CKCU_AUTO_TRIM_LEGACY)
  u32 lower_bound, upper_bound, i;
  static u32 ATCR = 0;

  if ((HT_CKCU->HSICR & (3ul << 5)) == 0)
  {
    lower_bound = 7812 - 19;
    upper_bound = 7812 + 19;
  }
  else
  {
    lower_bound = 8000 - 20;
    upper_bound = 8000 + 20;
  }

  SystemCoreClockUpdate();
  for (i = SystemCoreClock / 8000; i > 0; i--){};
  ATCR += HT_CKCU->HSIATCR;
  ATCR /= 2;

  if ((ATCR >= lower_bound) && (ATCR <= upper_bound))
  {
    ATCR = 0;
    return TRUE;
  }
  else
  {
    return FALSE;
  }

#else
  return (HT_CKCU->HSICR & 0x80) ? TRUE : FALSE;
#endif
}
#endif
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
